MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
/*!
 * @file mit_sim_main.cpp
 * @brief STM32MP1 MIT_Controller (convex MPC + WBC) against a Gazebo (Go1) SITL.
 *   mit_ctrl_sim [peer_ip] [robot_yaml] [user_yaml]
 * Runs the full locomotion FSM. With $WP_MISSION set it also closes an
 * OpenPilot-style GPS waypoint loop around it - see navThread() below.
 */
#include <string>
#include <cstdio>
#include <cstdlib>
#include <cmath>
#include <thread>
#include <chrono>
#include <unistd.h>   // _exit

#include "Stm32mp1HardwareBridge.h"
#include "MIT_Controller.hpp"
#include "WaypointNav.hpp"
#include "Planning/BodyPathPlanner.h"
#include "Planning/MissionAnalyzer.h"
#include "rt/rt_gazebo.h"      // gazebo_get_aux(): GPS, the same data the real dog gets over CAN

//! Defined in FSM_State_StandUp.cpp - lets the mission lower the stance target
//! so re-entering STAND_UP performs a controlled lie-down.
void setStandUpHeight(double h);
//! Defined in RobotRunner.cpp - Unitree-style damping hold (edampCommand).
void setEdamp(double d);
//! Defined in RobotRunner.cpp - gates the fall detector's z-collapse branch.
//! A COMMANDED lie-down is a level body descending through the detector's
//! 0.10 m threshold - indistinguishable from the collapse it exists to
//! catch - so the mission suspends the z branch around its own lie-downs
//! (the attitude branch stays armed; a lie-down is level by definition).
void setFallZEnable(bool on);
//! Defined in RobotRunner.cpp - true while the control loop has seen a
//! wall-clock scheduling overrun (a "host stall"). The mission reads this
//! and degrades gracefully - stop translating, hold, lie down if it
//! persists - because a stalled host multiplies every commanded force by
//! how long the tick actually took, and sprinting into that is the worst
//! available option. See the detector in RobotRunner::run().
bool hostStallActive();
//! Defined in RobotRunner.cpp - gates MIT's ZERO-debounce 28.6 deg
//! orientation ESTOP (ControlFSM::safetyPreCheck). During a commanded stop
//! the settle/crouch wobble can cross 28.6 deg for a tick; the ESTOP then
//! cuts the motors mid-maneuver and CAUSES the fall (and the stop sequence,
//! unaware the FSM was yanked to PASSIVE under it, drives a dead robot).
//! Gated off from the stop command until standing-and-driving again; the
//! debounced fall detector (50 deg / 0.5 s) stays the arbiter inside the
//! window, so a genuine tip still ends the run.
void setOrientTripEnable(bool on);
//! Situational stance-height bias into the controller's height governor, m.
void setHeightBias(double b);

static std::string g_peer;

/*!
 * Waypoint navigation for the MIT stack.
 *
 * The crawl (StaticGaitController) drives nav from inside its own controller
 * because it owns its gait. The MIT stack must not be reached into like that -
 * ConvexMPCLocomotion already consumes a velocity and a yaw rate through
 * DesiredStateCommand, which is exactly the interface an operator's stick uses.
 * So nav writes the SAME two channels the sequencer and a gamepad write:
 *   leftStickAnalog[1]  -> forward velocity  (_x_vel_des)
 *   rightStickAnalog[0] -> yaw rate          (_yaw_turn_rate)
 * Nothing in the FSM, the MPC or the WBC has to know navigation exists.
 *
 * Takeover: the bridge sequencer already stands the robot, enters LOCOMOTION,
 * lets the gait engage and ramps velocity to $SIM_VX. Nav waits for that ramp
 * to finish (it watches the stick the sequencer is driving) and then owns both
 * channels. Because the star mission's first waypoint lies due north and the
 * dog spawns facing north, the handover happens mid-stride on the correct
 * heading - no pivot in place.
 */
static void navThread(Stm32mp1HardwareBridge* bridge) {
  const char* mission = getenv("WP_MISSION");
  if (!mission) return;

  const float vx = getenv("SIM_VX") ? atof(getenv("SIM_VX")) : 0.6f;
  WaypointNav nav;
  float r = 3.f, d = 5.f; int pts = 5;
  if (sscanf(mission, "star:%f:%d", &r, &pts) >= 1)        nav.makeStar(r, pts, vx);
  else if (sscanf(mission, "oval:%f:%f", &d, &r) >= 1) {
    // "oval:<straight m>:<radius m>" - see makeOval for why this course exists.
    if (sscanf(mission, "oval:%f:%f", &d, &r) < 2) r = 3.0f;
    nav.makeOval(d, r,
                 getenv("WP_OVAL_DS") ? atof(getenv("WP_OVAL_DS")) : 1.2f, vx);
  }
  else if (sscanf(mission, "atom:%f:%d", &r, &pts) >= 1) {
    // "atom:<outer radius m>[:<lobes>]" - depth and waypoint spacing are
    // secondary knobs, so the mission string keeps only the two that change
    // the character of the course.
    if (sscanf(mission, "atom:%f:%d", &r, &pts) < 2) pts = 6;   // 6 = the logo
    nav.makeAtom(r, pts,
                 getenv("WP_ATOM_DEPTH") ? atof(getenv("WP_ATOM_DEPTH")) : 0.8f,
                 getenv("WP_ATOM_DS")    ? atof(getenv("WP_ATOM_DS"))    : 1.2f, vx);
  }
  else if (sscanf(mission, "circle:%f:%d", &r, &pts) >= 1) nav.makeCircle(r, pts, vx);
  else if (sscanf(mission, "dash:%f", &d) == 1)            nav.makeDash(d, vx);
  else if (sscanf(mission, "outback:%f", &d) == 1)         nav.makeOutAndBack(d, vx);
  // Four SAR patterns (International Aeronautical and Maritime Search and
  // Rescue Manual) plus Lissajous search curves - see WaypointNav.cpp for
  // the source and the geometry. Circle search is the "circle:" branch above.
  else if (sscanf(mission, "sector:%f:%d", &d, &pts) >= 1) {
    if (sscanf(mission, "sector:%f:%d", &d, &pts) < 2) pts = 3;   // 3 cycles
    nav.makeSectorSearch(d, pts, vx);
  }
  else if (sscanf(mission, "parallel:%f", &d) == 1) {
    float h = 5.f; int passes = 6;
    sscanf(mission, "parallel:%f:%f:%d", &d, &h, &passes);
    nav.makeParallelTrack(d, h, passes, vx);
  }
  else if (sscanf(mission, "expsquare:%f:%d", &d, &pts) >= 1) {
    if (sscanf(mission, "expsquare:%f:%d", &d, &pts) < 2) pts = 12;
    nav.makeExpandingSquare(d, pts, vx);
  }
  else if (sscanf(mission, "lissajous:%f", &d) == 1) {
    int wx = 1, wy = 2;
    sscanf(mission, "lissajous:%f:%d:%d", &d, &wx, &wy);
    nav.makeLissajous(d, wx, wy,
                       getenv("WP_LISS_DS") ? atof(getenv("WP_LISS_DS")) : 1.5f, vx);
  }
  else                                                     nav.makeStar(5.3f, 5, vx);

