MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  /*
   * TAKE THE STICK OURSELVES, from LOCOMOTION entry - not by waiting for the
   * bridge's own straight-line ramp to finish, which is what used to run the
   * dog dead ahead for the whole delay+ramp window before nav ever steered
   * (see the WP_MISSION guard added around that ramp in
   * Stm32mp1HardwareBridge.cpp for the measured symptom and why it is wrong
   * for a mission specifically). Wait for control_mode == 4 (K_LOCOMOTION),
   * then hold the SAME gait-engage settle the old ramp used
   * ($SIM_VX_DELAY_S, still the standing-gait settle time, not a straight-line
   * hold) before calling nav.update() for the first time - the planner's own
   * accel limit (a_lon/a_accel_max) ramps speed from the standstill the robot
   * is actually at, while STEERING from tick one instead of after 15 s of
   * running straight.
   */
  while (bridge->getControlMode() != 4)
    std::this_thread::sleep_for(std::chrono::milliseconds(50));
  {
    float settle_s = getenv("SIM_VX_DELAY_S") ? atof(getenv("SIM_VX_DELAY_S")) : 3.f;
    printf("[nav] LOCOMOTION engaged - holding %.1f s for the gait to settle "
           "before nav takes the stick\n", settle_s);
    fflush(stdout);
    std::this_thread::sleep_for(std::chrono::milliseconds((long)(settle_s * 1000.f)));
  }

  const auto t0 = std::chrono::steady_clock::now();
  auto elapsed = [&t0]() {
    return std::chrono::duration<float>(std::chrono::steady_clock::now() - t0).count();
  };
  printf("[nav] taking the stick at t=%.1fs (mission %s)\n", elapsed(), mission);
  fflush(stdout);
  /*
   * Anchor for the forward-speed ramp below - NOT armed on the initial
   * takeover (restart_t starts a full ramp window in the past, so vscale is
   * 1.0 immediately). BodyPathPlanner::computeSpeedProfile() now forces
   * _path[0].v = 0 and ramps it forward itself with the SAME accel limit, so
   * applying a second, independent time-based ramp here on top of that
   * double-ramps and desyncs the caller's notion of "how far along the plan
   * am I" from the plan's own arc-length-based one - measured to cost the
   * star ~4 s and a visibly wide, arcing entry into its first corner (see
   * the comment at that _path[0].v = 0 assignment for the full account).
   * The dash interlude's stand-back-up IS a genuine standstill the
   * pre-computed profile does not know about (plan() is never called again
   * mid-mission), so THAT restart still arms this ramp for real.
   */
  const float vx_ramp_s = getenv("SIM_VX_RAMP_S") ? atof(getenv("SIM_VX_RAMP_S")) : 3.f;
  float restart_t = elapsed() - vx_ramp_s;

  /*
   * GAIT DECIDER ($WP_GAIT_DECIDER=1) - Apollo's task of the same name, using
   * the planner's curvature knowledge: run the FAST gait on straights and the
   * agile one through corners.
   *
   * The rule that makes it safe came from a controlled split, not a guess:
   *   switch gait, then accelerate             -> CROSSES (2/2)
   *   switch gait and accelerate together      -> CROSSES (30.3 s at 3.97 m/s)
   *   switch to a SLOWER-capable gait AT SPEED -> FAILS (2/2, ~35 m)
   * Only the last is dangerous. So the decider only ever switches while the
   * robot is ALREADY SLOW - which on a star is exactly the corner, where the
   * planner has braked for curvature anyway. Both directions then land in the
   * regime measured to work: drop to trotting while braking in, restore
   * trotRunning at the apex BEFORE accelerating out.
   */
  const bool gait_decider = getenv("WP_GAIT_DECIDER") && atoi(getenv("WP_GAIT_DECIDER")) != 0;
  /*
   * THREE TIERS, not a pair. There is no single transition rule and no reason
   * to force one: the course asks for different things and the gaits answer
   * differently, so the schedule is graded the same way the corner speed now is.
   *
   *   STRAIGHT  trotRunning (5)  40%% duty, flight phase - fastest, worst turner
   *   MIDDLE    trotting    (9)  50%% duty - the best all-rounder measured, and
   *                              the one to LEAN ON: it alone completes the star
   *                              at 2.0-2.5 m/s, 7/7
   *   TIGHT     walking    (20)  50%% duty 4-beat - slowest, most stable, for
   *                              the corners neither of the others survives
   *
   * Tiers are chosen from the PLANNED speed, which already encodes corner
   * angle through the angle-graded budget - so gait and speed grade together
   * instead of one fighting the other.
   */
  const int  gait_fast   = getenv("WP_GAIT_FAST")   ? atoi(getenv("WP_GAIT_FAST"))   : 5;
  const int  gait_corner = getenv("WP_GAIT_CORNER") ? atoi(getenv("WP_GAIT_CORNER")) : 9;
  const int  gait_tight  = getenv("WP_GAIT_TIGHT")  ? atoi(getenv("WP_GAIT_TIGHT"))  : 0;  // 0 = unused
  /*
   * $WP_GAIT_REGIME=1 switches the decider from "how slow is it ahead" to
   * "how LONG is the turn ahead" - see BodyPathPlanner::regimeAhead. kappa is
   * 1/R, so 0.15 is a 6.7 m radius; regime_len is the run length above which a
   * flight gait is judged unable to hold on.
   */
  /*
   * $WP_ANALYZER=1 hands gait and height-bias decisions to the pre-analysed
   * mission. `analyzer_lead` is how far ahead the robot reads - a gait change
   * needs its ~500 ms settling window BEFORE the corner, not in it.
   */
  const bool  regime_mode  = getenv("WP_GAIT_REGIME") && atoi(getenv("WP_GAIT_REGIME")) != 0;
  const float regime_kappa = getenv("WP_REGIME_K")   ? atof(getenv("WP_REGIME_K"))   : 0.15f;
  const float regime_len   = getenv("WP_REGIME_LEN") ? atof(getenv("WP_REGIME_LEN")) : 3.0f;
  const float v_tight    = getenv("WP_V_TIGHT")     ? atof(getenv("WP_V_TIGHT"))     : 1.1f;
  const float decide_v   = getenv("WP_GAIT_SWITCH_V") ? atof(getenv("WP_GAIT_SWITCH_V")) : 1.6f;
  /*
   * cur_gait MUST start as the gait the robot is ACTUALLY running, which is
   * cmpc_gait from the yaml - not gait_corner.
   *
   * Initialising it to gait_corner made the decider believe it was already in
   * the corner gait, so it never switched INTO it: the robot took every corner
   * in the fast gait and fell in the first one, while the log showed a single
   * no-op "switch" to the gait it was already in. That bug is why
   * trotting-straights/walking-corners looked like a dead end - the pairing was
   * never actually exercised.
   */
  int cur_gait = bridge->userParams()
      ? (int)((MIT_UserParameters*)bridge->userParams())->cmpc_gait
      : gait_corner;
  /*
   * LOOKAHEAD: switch on the curvature AHEAD, not underfoot. An animal changes
   * gait BEFORE the corner, while it still has time; deciding from the speed at
   * the current point means the decision arrives once already committed.
   */
  const float decide_ahead = getenv("WP_GAIT_LOOKAHEAD") ? atof(getenv("WP_GAIT_LOOKAHEAD")) : 4.0f;

  // Height pre-load for corners - see setHeightBias() below. Off by default so
  // the governor's own contribution can be measured before this stacks on it.
  const float hbias_gain  = getenv("WP_HBIAS")       ? atof(getenv("WP_HBIAS"))       : 0.0f;
  const float hbias_ahead = getenv("WP_HBIAS_AHEAD") ? atof(getenv("WP_HBIAS_AHEAD")) : 5.0f;

  const float dt = 0.02f;      // 50 Hz: the gait's own bandwidth is far below this
  float yaw_ref = NAN;
  int   lastIdx = -1;
  bool  done = false;

  while (!done) {
    std::this_thread::sleep_for(std::chrono::milliseconds(20));
    if (!bridge->robotRunner()) continue;
    const auto& est = bridge->robotRunner()->getStateEstimate();

    SimAuxSensors aux;
    gazebo_get_aux(&aux);
    if (!nav.originSet()) {
      if (aux.gps_lat == 0.0) continue;
      nav.setOrigin(aux.gps_lat, aux.gps_lon);
      yaw_ref = est.rpy[2];    // the dog always starts facing north
      printf("[nav] GPS origin set, heading datum %.1f deg\n", yaw_ref * 57.2958f);
      fflush(stdout);
    }

    float N, E;
    nav.toLocal(aux.gps_lat, aux.gps_lon, &N, &E);
    // Compass bearing (0 = north, positive toward east) relative to the datum.
    // Taking it relative to the start makes this work identically whether the
    // estimator zeroes its yaw (VectorNav path) or reports true world yaw
    // (cheater path) - the two differ by exactly this constant.
    const float bearing = -(est.rpy[2] - yaw_ref);
    const float spd = sqrtf(est.vBody[0] * est.vBody[0] + est.vBody[1] * est.vBody[1]);

    float nv = 0.f, nw = 0.f;
    // NAV owns mission state (arrival tests, waypoint advance, completion); the
    // planner only supplies the COMMANDS. Letting the planner's end-of-path
    // decide completion would end the mission wherever the smoothed path ran
    // out, which is not where the waypoints are.
    bool running = nav.update(N, E, bearing, spd, dt, &nv, &nw);
    if (use_planner) {
      double pv = 0, pw = 0;
      if (planner.follow(N, E, bearing, &pv, &pw)) { nv = (float)pv; nw = (float)pw; }
    }

