MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
    /*
     * LOOP-TO-DASH INTERLUDE. The loop closed AND the explicit return to
     * wp00 (appendDash()'s first inserted point) is done - nav has just
     * advanced onto the actual dash waypoint - so stop, settle, lie down,
     * then stand back up before sprinting the dash, exactly mirroring the
     * end-of-mission sequence below rather than inventing a second one.
     * This blocks the thread for its duration (a few seconds), which is
     * fine: nothing else needs the stick during a controlled sit-and-stand,
     * and the alternative (driving it from the 50 Hz loop with a state
     * machine) buys nothing but complexity for a one-shot event.
     */
    if (dash_pending && lastIdx == dash_wp_index) {
      dash_pending = false;
      printf("[nav] loop complete at t=%.1fs - stop, lie down, stand back up "
             "before the %s dash\n", elapsed(), mission);
      fflush(stdout);

      // STOP WINDOW OPENS: forward command is being taken to zero on
      // purpose. Suspend the zero-debounce orientation ESTOP for the whole
      // stop/lie-down/stand-up maneuver (re-armed below once driving
      // again) - one transient 28.6 deg tick during the settle otherwise
      // cuts the motors mid-crouch and causes the very fall it polices.
      // The debounced fall detector stays armed as the window's arbiter.
      setOrientTripEnable(false);

      // 1. decelerate from cruise - a stepped-to-zero stick pitches the
      //    robot forward on the way down, same reasoning as end-of-mission.
      //
      //    WRONG TWICE before this, in opposite directions:
      //    - a short (1.5s, fixed) ramp was blamed for "pitching the robot
      //      forward" - but that test also had the (since-fixed) illegal
      //      BALANCE_STAND->STAND_UP transition confounding it, so the real
      //      cause was never isolated;
      //    - lengthening it to hold a gentler ~1.2 m/s^2 (this body's
      //      CORNERING deceleration rate, borrowed from a different
      //      manoeuvre than "come to a dead stop") made it WORSE: the stick
      //      still commands nonzero forward speed, UNSTEERED (yaw zeroed),
      //      for the entire ramp - at 3.5 m/s over a ~2.9 s ramp that is
      //      ~5 m of straight-line coasting PAST wp00 before it even starts
      //      meaningfully slowing, which is the overshoot actually observed
      //      live, not a planner or waypoint-arrival bug.
      //    Short and sharp instead - the goal at a stop is arriving close to
      //    the point, not a gentle deceleration profile - and BALANCE_STAND
      //    is no longer entered on a timer's say-so: the loop below polls
      //    the REAL measured body speed and only proceeds once it is
      //    actually low, with a bounded timeout as a backstop.
      // Ramp from the speed actually being COMMANDED right now, not from
      // cruise: the planner's mid-path stop (addStopXY at the loop closure)
      // has already braked the dog to ~v_min by the time this fires, so the
      // stick is at a creep - ramping "vx down to zero" from here would
      // first SPIKE the command back up to cruise.
      const float v_at_stop = bridge->driverCommand().leftStickAnalog[1];
      for (int k = 15; k >= 0; --k) {
        /*
         * STEERED deceleration. Zeroing yaw on the ramp's first tick while
         * the body still carries a turn's residual yaw/roll is what tipped
         * the OVAL's stop sideways (roll 53-88 deg, ~50%): its closure sits
         * 1.2 m off the exit of a continuous R=5 arc, so the dog stops
         * mid-straightening - where the star gets a 20 m straight run-in
         * and stops clean. Keep the follower's steering live through the
         * first 0.5 s of the ramp so the dog straightens onto the exit
         * heading as it slows; on a straight approach the follower already
         * outputs w~0 and this is a no-op (star behaviour unchanged, and
         * guarded by reps regardless).
         */
        float w_dec = 0.f;
        if (use_planner && k > 5) {
          SimAuxSensors aux2; gazebo_get_aux(&aux2);
          float N2, E2; nav.toLocal(aux2.gps_lat, aux2.gps_lon, &N2, &E2);
          const auto& es2 = bridge->robotRunner()->getStateEstimate();
          const float b2 = -(es2.rpy[2] - yaw_ref);
          double pv2 = 0, pw2 = 0;
          if (planner.follow(N2, E2, b2, &pv2, &pw2)) w_dec = (float)pw2;
        }
        bridge->driverCommand().leftStickAnalog[1]  = v_at_stop * (float)k / 15.f;
        bridge->driverCommand().rightStickAnalog[0] = w_dec;
        std::this_thread::sleep_for(std::chrono::milliseconds(50));
      }
      bridge->driverCommand().leftStickAnalog[1]  = 0.f;
      bridge->driverCommand().rightStickAnalog[0] = 0.f;
      {
        const float settle_start = elapsed();
        while (elapsed() - settle_start < 2.0f) {
          if (bridge->robotRunner()) {
            const auto& es = bridge->robotRunner()->getStateEstimate();
            const float spd = std::sqrt(es.vBody[0] * es.vBody[0] +
                                         es.vBody[1] * es.vBody[1]);
            if (spd < 0.15f) break;
          }
          std::this_thread::sleep_for(std::chrono::milliseconds(50));
        }
      }

      // 2. settle on its feet. (A 1.3 s trot-in-place settle was inserted
      //    here and REVERTED same-day: with the long zero-vel hold it took
      //    the oval's stop from ~1-in-3 tips to 7-of-8 - see the measured
      //    note at ConvexMPCLocomotion::zeroVelHold.)
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));

      // 3. lie down - re-enter STAND_UP with a low target (see the
      //    end-of-mission comment for why this reuses that interpolation).
      //    BALANCE_STAND -> STAND_UP is not a legal FSM transition
      //    (FSM_State_BalanceStand::checkTransition()'s switch has no
      //    K_STAND_UP case - every request fell to `default`, printing
      //    "Bad Request: Cannot transition from 3 to 1" and being silently
      //    ignored, so the dog just stood there under BALANCE_STAND's own
      //    control indefinitely - measured on a 3-dog fleet run: over a
      //    hundred rejected requests, then an eventual orientation-safety
      //    fall from prolonged undriven standing, never an actual lie-down).
      //    K_STAND_UP IS legal from K_PASSIVE
      //    (FSM_State_Passive::checkTransition() has that case), which is
      //    also the FSM's OWN normal bootstrap path (PASSIVE -> STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION), so hop through PASSIVE first.
      // PASSIVE cuts leg torque entirely at the FSM level, but
      // RobotRunner::finalizeStep() applies edampCommand() AFTER the FSM
      // state's own control regardless of which state is active - so
      // damping through this hop is not fighting PASSIVE, it is what
      // actually reaches the legs while PASSIVE would otherwise leave them
      // at true zero. Without this, a still-tall standing robot free-falls
      // for however long PASSIVE holds - measured as a real collapse
      // (roll/pitch/z all dropping) even at a bare 300 ms.
      // The z-collapse fall test cannot tell this COMMANDED crouch from a
      // real collapse (both are a level body under 0.10 m) - it killed the
      // process mid-lie-down on every dash run of 2026-08-24, which also
      // read as "the dog never stands back up". Suspend just the z branch
      // for the crouch; attitude tripping stays armed.
      setFallZEnable(false);
      setEdamp(8.0);
      bridge->setControlMode(0);                 // K_PASSIVE
      // As BRIEF as possible regardless - the FSM only needs ONE control
      // tick (2 ms) to register PASSIVE as current before it will accept
      // the next request, so this only has to outlast scheduling jitter.
      std::this_thread::sleep_for(std::chrono::milliseconds(20));
      // Hand off to STAND_UP's own controlled Cartesian interpolation
      // undamped - edamp fighting an active position controller defeats
      // the point of using that interpolation at all.
      setEdamp(0.0);
      setStandUpHeight(0.15);  // 0.07 measured to fall during the interpolation itself (roll/pitch stayed tiny - not a rollover - z sagged fast); trying a less extreme crouch that still counts as "lying down"
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      setEdamp(8.0);
      std::this_thread::sleep_for(std::chrono::milliseconds(1200));

      // 4. stand back up - restore the normal stand-up target (0.25, from
      //    FSM_State_StandUp.cpp's g_standUpHeight default) and go back
      //    through the SAME staged entry used at mission start: STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION. Skipping BALANCE_STAND here would
      //    hand the MPC the same 9 cm height step CLAUDE.md already measured
      //    as a launch (z 0.211 -> 0.342 at 0.32 m/s vertical).
      // RE-ENTER STAND_UP THROUGH PASSIVE. This is THE difference between
      // this sequence and the end-of-mission one that has always worked:
      // end-of-mission only ever lies DOWN, so it never hits this. Here the
      // robot is ALREADY in STAND_UP (that is how it lay down), and
      // FSM_State_StandUp interpolates on `progress = 2*iter*dt` capped at
      // 1.0 with `_ini_foot_pos` captured in onEnter() ONLY. After 2.5 s
      // crouched, iter is ~1250 and progress is pinned at 1.0 - so simply
      // raising g_standUpHeight 0.15 -> 0.25 and re-requesting K_STAND_UP
      // does NOT re-enter the state and does NOT interpolate: pDes[2] jumps
      // the full 10 cm in ONE tick against kpCartesian=500. That is a
      // launch, and it is why the dog fell "right after lying down" every
      // time. Hopping through PASSIVE forces a real state exit so onEnter()
      // re-captures the crouched foot positions and restarts the ramp -
      // exactly what mission start does (PASSIVE -> STAND_UP), which is the
      // pattern that has always worked.
      setEdamp(8.0);
      bridge->setControlMode(0);                 // K_PASSIVE (damped hop)
      std::this_thread::sleep_for(std::chrono::milliseconds(20));
      setEdamp(0.0);
      setStandUpHeight(0.25);
      bridge->setControlMode(1);                 // K_STAND_UP - fresh onEnter
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      bridge->setControlMode(4);                 // K_LOCOMOTION
      // Let the gait engage before asking it to go anywhere - the same
      // settle window the initial sequencer holds at mission start.
      std::this_thread::sleep_for(std::chrono::milliseconds(1000));
      // Apply any gait change the stop-window HOLD deferred, NOW - while
      // still STANDING in freshly-engaged LOCOMOTION (zeroVelHold keeps
      // the standing gait until driving resumes, so a cmpc_gait change
      // here engages exactly like mission start: on the first stride,
      // gracefully). Releasing it on the first DRIVING tick instead put a
      // live trot->trotRunning transition under the dash's very first
      // acceleration on a freshly-stood dog - measured on the oval's
      // fleet run: "back on its feet", the gait change, and the
      // orientation ESTOP all landed in the same second and the dash
      // never happened.
      if (use_analyzer && bridge->userParams()) {
        const planning::MissionSegment* segNow =
            analyzer.segmentAhead(planner.currentS(), analyzer_lead);
        if (segNow && segNow->gait != cur_gait) {
          ControlParameterValue cv2; cv2.d = (double)segNow->gait;
          bridge->userParams()->collection.lookup("cmpc_gait")
              .set(cv2, ControlParameterValueKind::DOUBLE);
          printf("[mission] held gait change applied while standing: "
                 "%d -> %d for the dash\n", cur_gait, segNow->gait);
          fflush(stdout);
          cur_gait = segNow->gait;
        }
      }
      // Standing tall and driving again - stop window closes: re-arm both
      // the z-collapse test and the orientation ESTOP for the dash.
      setFallZEnable(true);
      setOrientTripEnable(true);

      restart_t = elapsed();   // ramp forward speed again from this standstill
      printf("[nav] back up at t=%.1fs - dashing the final leg\n", elapsed());
      fflush(stdout);
    }

    if (!running) {
      printf("[nav] MISSION COMPLETE t=%.1fs  (%d waypoints)\n", elapsed(), nav.count());
      fflush(stdout);
      bridge->driverCommand().leftStickAnalog[1]  = 0.f;
      bridge->driverCommand().rightStickAnalog[0] = 0.f;
      done = true;
      // STOP WINDOW: same suspension as the interlude's (see that comment).
      // Never re-armed - the mission ends inside this window, and the
      // debounced fall detector plus the judge's own attitude criteria
      // cover it to the end.
      setOrientTripEnable(false);
      /*
       * END-OF-MISSION SEQUENCE, and the PASS/FAIL criterion.
       *
       * Reaching the last waypoint is not a completed mission - a robot that
       * arrives and then falls over has not done the job. The mission now ends
       * the way it began, in reverse: decelerate, settle on its feet, then LIE
       * DOWN under control. PASS requires all of it; anything else is FAIL.
       *
       * This also exercises exactly the transitions the hardware QA ladder
       * starts with (stand -> lie down -> stand up -> slow walk), so a mission
       * that passes here has rehearsed the sequence a real dog has to survive.
       */
      // 1. decelerate. Short and sharp, then VERIFY the real measured speed
      //    is actually low before touching the FSM - see the matching
      //    comment and the same fix in the loop-to-dash interlude above,
      //    where a longer "gentler" ramp turned out to just coast the dog
      //    several metres past the stopping point, unsteered, before
      //    slowing down at all.
      for (int k = 15; k >= 0; --k) {
        // STEERED deceleration - same fix and reasoning as the interlude's
        // decel above (a dash=0 oval ends right off the arc exit too).
        float w_dec = 0.f;
        if (use_planner && k > 5) {
          SimAuxSensors aux2; gazebo_get_aux(&aux2);
          float N2, E2; nav.toLocal(aux2.gps_lat, aux2.gps_lon, &N2, &E2);
          const auto& es2 = bridge->robotRunner()->getStateEstimate();
          const float b2 = -(es2.rpy[2] - yaw_ref);
          double pv2 = 0, pw2 = 0;
          if (planner.follow(N2, E2, b2, &pv2, &pw2)) w_dec = (float)pw2;
        }
        bridge->driverCommand().leftStickAnalog[1] = nv * (float)k / 15.f;
        bridge->driverCommand().rightStickAnalog[0] = w_dec;
        std::this_thread::sleep_for(std::chrono::milliseconds(50));
      }
      bridge->driverCommand().leftStickAnalog[1] = 0.f;
      bridge->driverCommand().rightStickAnalog[0] = 0.f;
      {
        const float settle_start = elapsed();
        while (elapsed() - settle_start < 2.0f) {
          if (bridge->robotRunner()) {
            const auto& es = bridge->robotRunner()->getStateEstimate();
            const float spd = std::sqrt(es.vBody[0] * es.vBody[0] +
                                         es.vBody[1] * es.vBody[1]);
            if (spd < 0.15f) break;
          }
          std::this_thread::sleep_for(std::chrono::milliseconds(50));
        }
      }

      // 2. settle on its feet (trot-in-place settle tried and reverted -
      //    see the interlude's matching note).
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      const auto& s1 = bridge->robotRunner()->getStateEstimate();
      const float stand_z = s1.position[2];
      const float stand_roll  = std::fabs(s1.rpy[0]) * 57.2958f;
      const float stand_pitch = std::fabs(s1.rpy[1]) * 57.2958f;

      // 3. LIE DOWN: re-enter STAND_UP with a low target so the same Cartesian
      //    interpolation that stands the robot up lowers it instead.
      //    BALANCE_STAND -> STAND_UP is not a legal FSM transition (see the
      //    matching comment in the loop-to-dash interlude above, where this
      //    was actually caught: FSM_State_BalanceStand::checkTransition()
      //    has no K_STAND_UP case, so this request was silently rejected
      //    every tick and the "lie down" never happened - hop through
      //    K_PASSIVE first, which IS a legal source for K_STAND_UP and is
      //    the FSM's own normal bootstrap path.
      // PASSIVE cuts leg torque entirely at the FSM level, but
      // RobotRunner::finalizeStep() applies edampCommand() AFTER the FSM
      // state's own control regardless of which state is active - so
      // damping through this hop is not fighting PASSIVE, it is what
      // actually reaches the legs while PASSIVE would otherwise leave them
      // at true zero. Without this, a still-tall standing robot free-falls
      // for however long PASSIVE holds - measured as a real collapse
      // (roll/pitch/z all dropping) even at a bare 300 ms.
      // Suspend the z-collapse fall test for this COMMANDED lie-down too -
      // same reason as the interlude's (see that comment): the detector was
      // killing the process mid-crouch, before the judge lines ever printed.
      setFallZEnable(false);
      setEdamp(8.0);
      bridge->setControlMode(0);                 // K_PASSIVE
      // As BRIEF as possible regardless - the FSM only needs ONE control
      // tick (2 ms) to register PASSIVE as current before it will accept
      // the next request, so this only has to outlast scheduling jitter.
      std::this_thread::sleep_for(std::chrono::milliseconds(20));
      // Hand off to STAND_UP's own controlled Cartesian interpolation
      // undamped - edamp fighting an active position controller defeats
      // the point of using that interpolation at all.
      setEdamp(0.0);
      setStandUpHeight(0.15);  // 0.07 measured to fall during the interpolation itself (roll/pitch stayed tiny - not a rollover - z sagged fast); trying a less extreme crouch that still counts as "lying down"
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      // 3b. DAMPING HOLD - Unitree's second phase. Their sequence is
      //     StandDown (interpolate the joints down) then edampCommand, so the
      //     robot settles compliant rather than holding a pose stiffly or going
      //     limp. Ported from LegController<T>::edampCommand at 0x1af2c0.
      setEdamp(8.0);
      std::this_thread::sleep_for(std::chrono::milliseconds(1200));
      const auto& s2 = bridge->robotRunner()->getStateEstimate();
      const float down_z = s2.position[2];
      const float down_roll  = std::fabs(s2.rpy[0]) * 57.2958f;
      const float down_pitch = std::fabs(s2.rpy[1]) * 57.2958f;

